Revit 2026 API

# TaskDialogWasVerificationChecked Method

---

Gets the status of the verification checkbox.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool WasVerificationChecked()
```
```vb
Public Function WasVerificationChecked As Boolean
```
```cpp
public:
bool WasVerificationChecked()
```
```fsharp
member WasVerificationChecked : unit -> bool
```

#### Return Value

Boolean Whether the verification checkbox is checked.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the task dialog does not have verification checkbox or the task dialog is not shown yet. |

#### Reference

TaskDialog Class

Autodesk.Revit.UI Namespace